[
  {
    "id": "sleep_minor_death_001",
    "title": "Sleep: The Minor Death",
    "description": "An exploration of the spiritual journey the soul undergoes during sleep according to Islamic tradition.",
    "cards": [
      {
        "title": "A Temporary Separation",
        "text": "Sleep is not merely physical rest; it is the soul being temporarily taken from the body. Every night, we stand at the edge of death as our Ruh is withdrawn."
      },
      {
        "title": "The Nightly Judgment",
        "text": "In a realm beyond our senses, a decision is made to either release the soul back until its appointed time or to keep those for whom death is decreed. No alarm or biological signal controls this return."
      },
      {
        "title": "Beyond the Physical Brain",
        "text": "While neuroscience observes REM cycles and brain waves, revelation explains that the soul itself is traveling. Science studies the shadow on the wall, but the Qur'an explains what casts it."
      },
      {
        "title": "The Soul’s Ascent",
        "text": "When a person sleeps, the soul ascends rather than just imagining or dreaming. In this state, some souls are shown signs, warned, or comforted."
      },
      {
        "title": "A Higher Perception",
        "text": "In sleep, the sensory filters and ego are quieted, allowing the soul to perceive truth directly. You are closer to the realm of Barzakh in sleep than when you are awake."
      },
      {
        "title": "The Spiritual Weight",
        "text": "Spiritual habits determine how the soul rises; mindfulness (Dhikr) makes it light and easy to ascend, while burdens of the heart can restrain it. Sleep reveals your true spiritual weight."
      },
      {
        "title": "Seeking Protection",
        "text": "Prophetic tradition teaches us to ask for mercy if the soul is taken and protection if it is returned. This preparation acknowledges that the soul is exposed during the night."
      },
      {
        "title": "The Daily Resurrection",
        "text": "Waking up is a revival and a rehearsal for the final Day of Judgment. We praise the one who gives us life again after causing us to undergo a temporary death."
      },
      {
        "title": "The Permanent Departure",
        "text": "One day, the soul will not be released back to the body. If our nights are empty of remembrance or our days heavy with wrongdoing, the soul's ascent reflects that state."
      }
    ],
    "reference": "Qur'an 39:42, Sahih Bukhari",
    "insight": "Sleep is a nightly mercy and a silent test: will the soul be returned?"
  }
]
